01  WS-DATA-AREA. 
05  WS-AMOUNT PIC 9(5)V99 VALUE 0. 
05  WS-COUNTER PIC 9(3) VALUE 0. 

PROCEDURE DIVISION. 
    PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 10 
       ADD 10.25 TO WS-AMOUNT 
       DISPLAY "Iteration " WS-COUNTER ", Amount: " WS-AMOUNT
    END-PERFORM. 
    STOP RUN.